app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
    @users = User.paginate(page: params[:page])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('2013-07-20 21:11:09', 'example@railstutorial.org', 'Rails Tutorial', '$2a$10$4RFWb1aH3Fi3/RMzT12LDONkKNUoqS/NhFZJtr3KAaoeuumTaNewu', '2013-07-20 21:11:09')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
 def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])